БИТУправление_медицинским_центром_демо/src/InformationRegisters/Helix_НастройкиВзаимодействия/Helix_НастройкиВзаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Helix_НастройкиВзаимодействия</name>
  <comment>Интеграция с лабораториями  Helix</comment>
  <resources>
    <name>FTPСоединениеПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПуть</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СоздаватьНовуюНоменклатуру</name>
    <comment>Используется при синхронизации справочников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаЗагрузкиНоменклатуры</name>
    <comment>Используется при синхронизации справочников</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ИзменятьГруппуНоменклатурыПриПовторнойЗагрузке</name>
    <comment>Используется при синхронизации справочников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьРеквизитыНоменклатурыПриПовторнойЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпециализацияНовойНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </resources>
  <resources>
    <name>Лаборант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>КодМестаЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрактИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОбрабатываемыхЗаРазФайлов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </resources>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПечатьЭтикеток</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагружатьЗаключенияВФорматеPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПулыНомеровЗаявокЛабораторий/ПулыНомеровЗаявокЛабораторий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПулыНомеровЗаявокЛабораторий</name>
  <resources>
    <name>ТекущийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияТекущегоНомера</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Закрыт</name>
    <comment>Пул больше не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВнешниеЛаборатории/ВнешниеЛаборатории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВнешниеЛаборатории</name>
  <enumValues>
    <name>Helix</name>
  </enumValues>
  <enumValues>
    <name>Invitro</name>
  </enumValues>
  <enumValues>
    <name>СитиЛаб</name>
  </enumValues>
  <enumValues>
    <name>КДЛ</name>
  </enumValues>
  <enumValues>
    <name>Гемотест</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/Helix_НастройкиВзаимодействия/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДекорацияСсылкаНаПулНомеров.Видимость = Запись.ИспользоватьПечатьЭтикеток;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ВидЛаборатории = ПредопределенноеЗначение("Перечисление.ВнешниеЛаборатории.Helix");
	Если Не ЛабораторияСервер.ПараметрыЗабораАнализовЗаполненыЛаборатории(ВидЛаборатории) Тогда
		Ответ = Вопрос("Заполнить параметры забора анализов?",РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЛабораторияСервер.ЗагрузитьПараметрыЗабораИзВнутреннихМакетов(ВидЛаборатории);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПрейскурантПриИзменении(Элемент)
	
	Если Запись.Прейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант") Тогда
		Запись.Прейскурант = ПредопределенноеЗначение("Справочник.Прейскуранты.ПустаяСсылка");
		
		СообщениеПользователю = Новый СообщениеПользователю; 
		СообщениеПользователю.Поле = "Прейскурант";
		СообщениеПользователю.Текст = "Нельзя выбирать основной прейскурант!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаПулНомеровНажатие(Элемент)
	Отбор = Новый Структура("Лаборатория", Запись.Лаборатория);
	ОткрытьФорму("РегистрСведений.ПулыНомеровЗаявокЛабораторий.ФормаСписка", Новый Структура("Отбор", Отбор) , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПечатьЭтикетокПриИзменении(Элемент)
	Элементы.ДекорацияСсылкаНаПулНомеров.Видимость = Запись.ИспользоватьПечатьЭтикеток;
КонецПроцедуры

#КонецОбласти
